Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་མེ་ལོང་འབར་བར་འགྱུར་རོ། །གཅིག་ཁོ་ནར་ཁ་དོག་སྣ་ཚོགས་པར་འབར་བར་འགྱུར་རོ།
en: When he has reached the number one thousand and eight, the mirror will blaze with light of different colors that combine into a single blaze.

source: །འཇིག་རྟེན་དབང་ཕྱུག་གི་སྐུ་གཟུགས་དེ་ལས་ལྷ་རྫས་ཀྱི་ཆུ་འཛག་གོ། །འོད་ཟེར་སྣ་ཚོགས་འབྱུང་ངོ་།
en: The figure of the Lokeśvara will ooze divine water and radiate light.

source: །དེ་ནས་རིག་སྔགས་འཆང་བའི་ལུས་འབར་ཞིང་དགའ་བར་འགྱུར་རོ།
en: The vidyā holder will get goose bumps of excitement, and his body will emit light.

source: །དོན་ཡོད་པར་དགའ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཆོ་ག་ཞིབ་མོ་གྲུབ་པ་འཐོབ་པར་འགྱུར་རོ། །ལུས་ཤིན་ཏུ་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: He will attain the accomplishment called amogha purity of joy, which is the heart essence of this rite, and his body will become immaculately pure.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མངོན་སུམ་དོན་ཡོད་པའི་ཞགས་པ་རྣམ་པར་འཕྲུལ་པ་འགྲུབ་པ་བསྟན་པར་བྱ་དགོས་པས།
en: At this stage he will exhibit the ability to produce magical displays of Amoghapāśa for the entire world to see. “

source: དེ་ནས་རིག་སྔགས་འཆང་བས་ས་དང་བའི་ལྕི་བ་བསྲེས་པའི་དཀྱིལ་འཁོར་རྒྱར་ཁྲུ་བཞི་འཕང་དུ་ཁྲུ་དོ་པ་བྱས་ལ་ཤིན་ཏུ་མཁྲེགས་པ་ཤིན་ཏུ་འཇོམ་པར་བྱའོ།
en: Next, the vidyā holder should build a four-cornered maṇḍala using clay and cow dung. It should be four cubits wide and two cubits high, and it should be smooth and wiped clean.

source: །ཐིག་སྐུད་ཀྱིས་རྣམ་པར་ཕྱེ་སྟེ།
en: Using a measuring thread, he should divide the maṇḍala into sections of different colors.

source: ཚོན་སྣ་ཚོགས་རྣམ་པར་དབྱེ་ཞིང་སྒོ་བཞི་རྣམ་པར་ཕྱེ་ནས་དཀྱིལ་འཁོར་གྱི་སྒོ་རྣམ་པར་ཕྱེ་སྟེ།
en: He should demarcate the four doors and, in the inner area, delineate a circular lotus with one hundred and eight petals, each distinguished by its skillfully applied colors.

source: པདྨ་འདབ་མ་བརྒྱད་ཚོན་གྱིས་གསལ་བར་བྲི་ཞིང་པདྨའི་དཀྱིལ་དུ་གེ་སར་དང་ཟེ་བ་བྱའོ།
en: The lotus should be complete with stamens and the orb of the pericarp.

source: །སྟེགས་བུ་གྲུ་བཞི་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་དང་།
en: He should surround the lotus by drawing a square veranda adorned with various jewels. “

source: སྟེགས་བུ་གྲྭ་བཞིར་རྒྱལ་པོ་ཆེན་པོ་བཞི་གོ་ཆ་བགོས་པ་གཏུམ་པ་འཇིགས་པར་བྱེད་པའི་གཟུགས་བྲི་བར་བྱའོ། །སྟེགས་བུའི་དབུས་ཀྱི་གནས་པར་བར་དུ་ལྷ་དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། གཞོན་ནུ་དང་། ལུས་ངན་པོ་དང་།
en: In the four corners of the veranda he should draw the Four Great Kings wearing cuirasses and coats of mail, their fierce appearance inspiring fear.

source: ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ལྷ་དབང་ཕྱུག་དང་། ཕྱག་ན་རྡོ་རྗེ་དང་། རལ་པ་གཅིག་པ་དང་།
en: At the points midway between the corners of the veranda he should draw the deities Īśvara, Maheśvara, Yama, Varuṇa, Kubera, Kumāra, Brahmā, Viṣṇu, Maheśvara, and Indra, as well as the deities Vajrapāṇi, Ekajaṭā, Tārā, Śvetā, Bhṛkuṭī, and Vajradūtī.

source: སྒྲོལ་མ་དང་། དཀར་མོ་དང་། ཁྲོ་གཉེར་མ་དང་། རྡོ་རྗེ་ཕོ་ཉ་མོ་རྣམས་ཚོན་སྣ་ཚོགས་ཀྱིས་བྲི་ཞིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། མེ་ཏོག་སྣ་ཚོགས་ཐོགས་པ་བྱའོ།
en: They should all be drawn in their various distinctive colors, adorned with every ornament and holding various colorful flowers.

source: །སྟེགས་བུའི་ཕྱི་རོལ་དུ་མདུང་རྩེ་གསུམ་པའི་ཕྲེང་བ་དང་། རྡོ་རྗེའི་ཕྲེང་བ་དང་། པདྨའི་ཕྲེང་བ་ཀུན་དུ་བྱའོ། །ཕྲེང་བའི་བར་དབུས་དང་། གྲྭའི་བར་དུ་ལྷ་མོ་བརྒྱད་དང་འཇིགས་བྱེད་མ་དང་། དཔེ་མེད་མ་དང་། བ་སན་ཏི་དང་།
en: Outside the veranda and surrounding it on all sides, the vidyā holder should draw a row of tridents, a row of vajras, and a row of lotuses. “

source: དཔལ་སྒྲ་དབྱངས་དང་། སའི་ལྷ་མོ་དང་། དུང་ཅན་མ་དང་། པུས་པ་དན་ཏི་རྣམས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། མེ་ཏོག་སྣ་ཚོགས་དང་རིན་པོ་ཆེའི་སྣོད་ཐོགས་པར་བྱའོ།
en: In the inner zone between the three rows, at the four corners and the middle points between them, he should draw, respectively, the eight goddesses Bhīmā, Anaupamyā, Vāsantī, Śrī, Sarasvatī, Pṛthivī, Śaṅkhinī, and Puṣpadantī, each adorned with every ornament and holding a dish of various flowers and jewels.

source: །ཕྱི་རོལ་ཐོག་ཐག་ཏུ་ཕྲེང་བའི་བར་བར་དུ་དྲི་སྣ་ཚོགས་ཀྱིས་དཀྱིལ་འཁོར་བསྐུ་ཞིང་ཙནྡན་དཀར་པོ་དང་། གུར་གུམ་གྱིས་མཆོད་པ་སྣ་ཚོགས་བྱའོ། །ག་པུར་དང་། གླ་རྩིས་མཆོད་ཅིང་།
en: In the outer zone between the three rows smeared with various fragrances such as white sandalwood and saffron, he should offer various kinds of worship using substances such as camphor and musk.

source: དཀྱིལ་འཁོར་ཀུན་དུ་དར་སྣ་ཚོན་སྣ་ལྔའི་རྒྱལ་མཚན་དང་། མདའ་དང་། རྟ་བབས་ཀྱིས་བརྒྱན་པར་བྱའོ།
en: He should adorn the entire maṇḍala with five-colored streamers, banners, arrows, and archways.

source: །དངུལ་གྱི་སྣོད་བཞི་ཅུང་པེང་གིས་བཀང་སྟེ་གཞག་པར་བྱའོ། །དངུལ་གྱི་སྣོད་བཞི་གཏོར་མ་དཀར་གསུམ་གྱིས་དགང་བར་བྱའོ། །དངུལ་གྱི་སྣོད་བཞིར་མཆོད་ཡོན་གྱི་ཆུ་གཞག་པར་བྱའོ།
en: He should arrange four silver vessels filled with flour cakes, another four filled with the three ‘white’ foods, and another four filled with argha water for the feet.

source: །སྣོད་བརྒྱད་རོ་སྣ་ཚོགས་ཀྱི་གཏོར་མས་དགང་བར་བྱའོ།
en: Another eight vessels should be filled with bali articles of various flavors. “

source: །འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་གཞག་པར་བྱའོ། །ཁ་ཟས་བཟའ་བ་དང་། གཏོར་མ་རྣམ་པ་སྣ་ཚོགས་གཞག་པར་བྱའོ། །དྲི་སྣ་ཚོགས་དང་། བྱུག་པས་དངུལ་གྱི་སྣོད་བཀང་སྟེ་གཞག་པར་བྱའོ།
en: He should add an assortment of fruits and other bali articles of food and drink, including a silver vessel with various fragrances and scented oils.

source: །དངུལ་གྱི་པོག་ཕོར་བརྒྱད་ཙནྡན་དང་། ཨ་ག་རུ་དང་། ཏུ་རུ་སྐ་དང་། ག་པུར་དང་། གླ་རྩི་དང་། གུར་གུམ་དང་། སྲ་རྩི་པོག་དང་།
en: He should fill eight silver incense holders with various types of incense, such as sandalwood, agarwood, olibanum, camphor, musk, saffron, sal tree resin, and frankincense, and then light them.

source: པོག་གིས་གང་བར་བྱ་ཞིང་བདུག་སྤོས་སྣ་ཚོགས་པ་སྲེག་གོ། །དངུལ་དང་། ཟངས་དང་། གསེར་གྱི་མེ་ཏོག་གི་སྙིང་པོའི་དཀྱིལ་འཁོར་དུ་གཅལ་དུ་དགྲམ་མོ། །ཕྱིའི་དཀྱིལ་འཁོར་དུ་ཇི་ལྟར་རྙེད་པའི་མེ་ཏོག་གཙལ་དུ་དགྲམ་པར་བྱ་སྟེ།
en: He should strew flowers made of silver, copper, and gold around the inner maṇḍala, and any available flowers around the outer maṇḍala.

source: ཕྲེང་བ་རྣམས་ཁོར་ཡུག་ཏུ་བསྐོར་ནས་བཞག་སྟེ།
en: He should also surround the maṇḍala with garlands.

source: དེ་ལ་ཡང་མེ་ལོང་ལེགས་པར་བརྒྱན་པར་བྱས་ནས། དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་པདྨའི་གེ་སར་དང་ཟེའུ་འབྲུ་ལ་ཤར་དུ་ཕྱོགས་པར་གཞག་པར་བྱའོ།
en: He should then place the well-adorned mirror facing east upon the lotus pericarp in the center of the maṇḍala, among the lotus filaments. “

source: །རིག་སྔགས་འཆང་གཙང་མ་ཁྲུས་བྱས་གོས་གཙང་མ་བགོ་བར་བྱ་སྟེ། དཀྱིལ་འཁོར་གྱི་ལས་དང་།
en: The vidyā holder should then purify himself ritually, wash thoroughly, and put on clean clothes.

source: བྱ་བ་ཐམས་ཅད་བྱས་ནས་མེ་ལོང་ལ་མངོན་དུ་ཕྱོགས་ཏེ། སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་པར་གྱུར་ནས་འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་བརྗོད་དབུལ་བར་བྱ་སྟེ།
en: Having done all the required preparations for the maṇḍala, he should sit cross-legged opposite the mirror and recite the heart mantra of Amoghapāśa.

source: བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་རྫོགས་པ་དང་།
en: After completing one hundred and eight recitations, he should consecrate the mirror with the mantra of Krodharāja.

source: ཁྲོ་བོའི་རྒྱལ་པོས་དབང་བསྐུར་རོ། །དབང་བསྐུར་བ་ཙམ་གྱི་མོད་ལ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མངོན་སུམ་དང་། འཁོར་ཆེན་པོའི་དབུས་སུ་མེ་ལོང་གི་དབུས་དེར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གི་གཟུགས་ཀྱིས་མཐོང་སྟེ།
en: As soon as the vidyā holder consecrates it, Noble Avalokiteśvara will appear in person in the mirror, clearly visible to everyone, in the midst of a great assembly.

source: མེ་ལོང་གི་དབུས་དེ་ནས་རིག་སྔགས་འཆང་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པར་མཛད་དོ།
en: From the mirror, he will congratulate the vidyā holder: ‘Good!

source: །རིག་སྔགས་འཆང་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ།
en: It is good, O great vidyā holder!

source: །བདག་ལ་དོན་ཡོད་པའི་མེ་ལོང་ལ་འབེབས་པའི་དེ་ཁོ་ན་ཉིད་དམ་པར་གྱུར་པ་འདི་ཐམས་ཅད་ཡང་དག་པར་མཐོང་སྟེ།
en: You can see everything, as it truly is, actually present in this marvelous mirror of mine.

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ལས་ཀྱི་འབྲས་བུ་བླ་ན་མེད་པ་ཞེས་བྱ་བ་ཡོངས་སུ་དག་པ་ཉིད་དོ།
en: This is the excellent result of your worldly and supramundane actions.

source: །རིག་སྔགས་འཆང་ཁྱོད་ཀྱིས་འབྲས་བུ་ཆེན་པོའི་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་མཚུངས་པ་མེད་པ་ཐོབ་བོ།
en: Thoroughly purified, you have attained, vidyā holder, the unexcelled supramundane path. This is a great result indeed!

source: །ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྒྲུབ་པའི་ཆོ་ག་དང་། ཆོ་ག་ཞིབ་མོ་དང་། དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱ་གྲུབ་བོ།
en: You have accomplished the essence of Amoghapāśa by following the practice procedure that is at once worldly and supramundane, one that relies on the ritual involving the maṇḍala and the mudrās.

source: །རིག་སྔགས་འཆང་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་མཆོག་གང་འདོད་པ་སྨྲོས་ཤིག །
en: Please choose a boon, O vidyā holder, and I will grant it in full; it can be worldly or supramundane.’ “

source: དེ་ཐམས་ཅད་སྦྱིན་པར་བྱའོ་ཞེས་སོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་མཆོག་གང་དོན་དུ་གཉེར་བ་དེ་བླངས་ནས་ཐམས་ཅད་འཕྲལ་ཉིད་དུ་སྦྱིན་པར་བྱེད་དོ། །འཁོར་གྱི་དཀྱིལ་འཁོར་གང་ཡིན་པ་དེར། ཀུན་ནས་འོངས་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། དམངས་རིགས་དང་། རྗེའུ་རིགས་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བཀྲབས་པ་དང་། མདུན་ན་འདོན་དང་། བཙུན་མོའི་འཁོར་དུ་ཀུན་འོངས་པ་དང་།
en: The vidyā holder should then state the boon he would like, and Noble Avalokiteśvara will grant it instantly and in full.

source: བསོད་ནམས་དང་ལྡན་པའམ། བསོད་ནམས་དང་མི་ལྡན་པའམ། ཡོངས་སུ་དག་པའམ། ལྟ་བ་ངན་པའམ། གཞན་དམྱལ་བ་བའི་སེམས་ཅན་གཏི་མུག་གི་མུན་པ་ལྷུད་བ། མནར་མེད་པ་ལ་གཞོལ་བ། མཚམས་མེད་པ་ལྔ་བྱེད་པ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ། དམ་པའི་ཆོས་སྤོང་བ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་ལའང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ལུས་དེ་ལ་སྟོན་པར་བྱེད། ཐམས་ཅད་དུ་སྨྲ་བར་བྱེད། ཡང་དག་པར་དབུགས་འབྱིན་པར་བྱེད། ཐམས་ཅད་དུ་རང་གི་ལས་ལ་དགེ་བའམ། མི་དགེ་བའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་དེ་ཐམས་ཅད་སྟོན་པར་བྱེད་དོ།
en: All the beings gathered in that assembly—women, men, boys, girls, ascetics, brahmins, kṣatriyas, vaiśyas, śūdras, and kings with their ministers, advisers, priests, and harem, regardless of whether they possess merit, have pure hearts, have wrong views, have fallen into various hells in the blindness of their ignorance, are destined for rebirth in the Avīci hell after committing the five acts of immediate retribution, have slandered the noble ones, or have opposed the true Dharma—will see the real Noble Avalokiteśvara, who will converse with each of them, comfort them, and tell them what good or bad karma they have and how it will ripen for them.

source: །རིག་སྔགས་ཀྱིས་ཆོམ་རྐུན་དང་། གདོལ་པ་དང་། རིག་སྔགས་སྤོང་ཞིང་ཉམས་པར་བྱེད་པ་དང་། རིག་སྔགས་སུན་འབྱིན་པར་བྱེད་པ་དང་། རིག་སྔགས་ལ་མ་དད་ཅིང་གུས་པས་མི་ཉན་པ་དེའི་མི་མཐོང་བ་ནི་མ་གཏོགས་ཏེ།
en: No such explanation will be given to the vile thieves of vidyās, the degraded individuals who spurn the vidyās, or those who want to hear the vidyās but lack faith—they will be excluded.

source: གཞན་དུ་ན་རང་གི་ལས་ཀྱི་འབྲས་བུ་སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ངེས་པར་འབྱུང་བར་མཐོང་ངོ་།
en: Instead, they will see the painful results of their own karma ripening for them. “

source: །དེ་ནས་སེམས་ཅན་དེ་རྣམས་གང་འདོད་པའི་དོན་ཡིད་ལ་བྱེད་པ་འཇུག་སྟེ། འཇིག་རྟེན་པའམ་འཇིག་རྟེན་ལས་འདས་པ་དེ་ཐམས་ཅད་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་རུ་རང་རང་གི་འབྲས་བུ་ངེས་པར་འབྱུང་བ་བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པའི་འབྲས་བུ་མཐོང་བར་བྱེད་དོ།
en: At that time, all the beings in that great assembly who harbor particular wishes, whether worldly or supramundane, will see the results according to their merit or lack thereof.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་མཐོང་ངོ་།
en: They will see all the buddha fields with their tathāgatas.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ཆེན་པོ་དང་། ཁང་པ་བརྩེགས་པ་དང་བཅས་པའི་གཞལ་ཡས་ཁང་མཐོང་ངོ་།
en: They will see the individual forms of the great tathāgatas, along with their temples and palaces.

source: །པོ་ཊ་ལ་ཀའི་རི་བོའི་གཞལ་ཡས་ཁང་རྣམས་བཅོམ་ལྡན་འདས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ་དང་།
en: They will see the palaces on Potala Mountain and the magical displays of the Blessed One.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འཁོར་དང་བཅས་པ་གཞལ་ཡས་ཁང་ན་ལྷ་དང་ཀླུས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ངོ་། །གཞན་ཇི་ལྟར་ད་ལྟར་གྱི་དགེ་བ་དང་མི་དགེ་བའམ། ལོ་ལེགས་པ་དང་། ལོ་ཉེས་པའམ།
en: They will see the palace, surrounded by devas and nāgas, where Noble Avalokiteśvara stays with his retinue.

source: ནད་དང་། འཆི་བ་དང་། ཚེ་ཐུང་བ་དང་། ཚེ་རིང་བ་དང་། རང་གི་དམག་ཚོགས་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། གཡུལ་དང་། འཁྲུག་པ་དང་། འཇིགས་པ་དང་། རྒྱལ་བའམ།
en: They will see all the good and bad that will happen, such as abundance or famine, disease and pestilence, short or long lifespans, and the danger of assault by one’s own or foreign armies, as well as the subsequent victories or defeats.

source: འཕམ་པའམ། རླག་པའམ། མ་བརླགས་པའམ། ཡམས་དང་། ཆར་ཆེས་པའམ།
en: They will see whether they will perish or live. “

source: དུས་མ་ཡིན་པའི་ཆར་རམ། ཆར་མེད་པའམ། རླུང་ངམ། སད་དམ། ཚངས་པ་ཡང་རུང་སྟེ་དེ་དག་ཐམས་ཅད་མཐོང་ངོ་། །ནོར་དང་ལྡན་པའམ། ཉམས་པའམ།
en: They will see all calamities such as excessive rain, untimely rain, drought, hurricanes, and cold and hot spells.

source: འཕེལ་བའམ། ལོ་ཐོག་གམ། མེ་ཏོག་གམ། འབྲས་བུ་འཕེལ་བ་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་མཐོང་ངོ་། །ཆོམ་རྐུན་དང་།
en: They will see their acquired wealth, any loss or increase thereof, and the increase of their stores of grain, flowers, or fruits.

source: རྐུན་པོ་དང་། དུག་དང་། མཚོན་ཆའི་འཇིགས་པའམ། རྒྱལ་པོའི་འཇིགས་པའམ། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་།
en: They will see any forthcoming dangers from thieves, bandits, poison, weapons, or kings, as well as any dangers from yakṣas, rākṣasas, bhūtas, ḍākinīs, or apasmāras.

source: མཁའ་འགྲོ་མ་དང་། བརྗེད་བྱེད་ཀྱི་འཇིགས་པ་དེ་ཐམས་ཅད་མཐོང་ངོ་།
en: They will see all of this.

source: ནོར་ཆེན་པོའམ། ནོར་མེད་པ་དེ་ཐམས་ཅད་མཐོང་ངོ་།
en: They will see any great treasure troves.

source: །འཆི་འཕོ་བ་དང་། སྐྱེ་བ་མཐོང་ངོ་།
en: They will see their demise and subsequent rebirth.

source: །བུ་ཐོབ་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་དང་། ལྗོངས་ཐོབ་པ་དང་།
en: They will see if they will obtain a son, a village, a town, a district, a province, or a wife.

source: བུད་མེད་ཐོབ་པ་དེ་ཐམས་ཅད་མཐོང་སྟེ།
en: They will see all of this.

source: འདི་ལ་དོགས་པ་དང་། ཡིད་གཉིས་དང་། ཐེ་ཙོམ་བསྐྱེད་པར་མི་བྱ་ཞིང་།
en: This should not be denied or subject to doubt or uncertainty.

source: མཆོག་ཏུ་དད་པ་དང་གུས་པས་ཤིན་ཏུ་འབད་དེ་ཆོ་ག་འདི་བསྒྱུར་བར་བྱའོ།
en: Instead, this rite should be performed with all care, in the spirit of utmost faith and respect. “

source: །དོན་ཡོད་ཞགས་པའི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དུ་འཇིག་རྟེན་ལས་འདས་པའི་སྒྲུབ་ཐབས་ཀྱི་ཆོ་ག་རྫོགས་སོ།། །།
en: This concludes the practice procedure of the maṇḍala of liberation of Amoghapāśa.”

source: དེ་ནས་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Vajrapāṇi, the great yakṣa general, said to the Blessed One, “Look, O Blessed One!

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་གསུངས་པ་ཆོ་ག་ཞིབ་མོའི་ཉེ་བར་སྤྱོད་པ་དང་བཅས་པ་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། རས་རིས་ཤིན་ཏུ་ཟབ་པ།
en: The bodhisattva Avalokiteśvara has taught the heart essence of Amoghapāśa that includes ritual prescriptions, worship, maṇḍalas, mudrās, and cloth paintings.

source: ཤིན་ཏུ་གཏིང་དཔག་དཀའ་ཞིང་། ཤིན་ཏུ་རྒྱ་ཆེ་ལ། ཤིན་ཏུ་སྒྲུབ་དཀའ་བ་དང་། དཀྱིལ་འཁོར་མང་པོ་དང་།
en: It is very deep, difficult to fathom, vast, and difficult to accomplish.

source: ཕྱག་རྒྱ་མང་པོ་དང་། གསང་སྔགས་མང་པོ་དང་། རས་རིས་མང་པོ་ཡོངས་སུ་བསྒྲགས་པ་རྣམས་ནི་རབ་རིབ་དང་བྲལ་བར་མཐོང་སྟེ།
en: Many maṇḍalas, mudrās, mantras, and paintings have been made widely known, but please dispel my ignorance further, O Blessed One!

source: བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོ་དུག་ཅན་པ་ཟབ་པ་ལྟ་བུ། ལྷུན་པོ་ཆེན་པོ་དང་མཚུངས་པ་ལྟ་བུ།
en: There are infinite rites that are as deep as a great ocean and as high as Mount Sumeru.

source: སྨིག་རྒྱུ་ལྟ་བུ། རྡུལ་ཕྲ་རབ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་མཚུངས་པ་ལྟ་བུ།
en: Illusion-like, they are also like the smallest particle.

source: བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ། མཚུངས་པ་མེད་པ། གཞལ་དུ་མེད་པ། ཚད་མེད་པ།
en: They match the extent of the Tathāgata’s knowledge, are beyond calculation and comparison, and are infinite and limitless.

source: བསྐལ་པའི་གྲངས་ཀྱིས་བགྲང་བར་བྱ་བ་མེད་པའི་བསྐལ་པའི་ཚད་མ་དང་།
en: Their number is infinite, and so is their scope.

source: བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚད་མ་དང་། ལྷའི་ཡུལ་གྱི་ཚད་མ་དང་། ཀླུའི་ཡུལ་གྱི་ཚད་མ་དང་། སེམས་ཅན་གྱི་ཚད་མ་དང་།
en: The scope of these rites is inconceivable, and so are the domains of the devas, nāgas, and other beings.

source: དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚད་མ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱན་ལ་སྣང་བའི་ཚད་མ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་ཀུན་དུ་སྣང་བའི་ཚད་མ་དང་།
en: The domain of the tathāgatas is inconceivable, as is the range of their vision and the scope of their knowledge.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་ཚད་མ་དང་། བདུད་ཀྱི་ཡུལ་གྱི་ཚད་མ་རྣམས་ཀྱིས་ཐོག་མར་དམིགས་པ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་བར་དུ་ཡང་དམིགས་པ་མ་ལགས། བཅོམ་ལྡན་འདས་བར་དུ་ཡང་དམིགས་པ་མ་ལགས་སོ། ཐ་མར་ཡང་མ་ལགས་ན།
en: There is, O Blessed One, no beginning, no middle, and no end to the knowledge of the bodhisattvas or to the domain of Māra. “

source: བཅོམ་ལྡན་འདས་དེ་ཅི་ལྟར་ཡོངས་སུ་ཤེས་པར་བགྱི།
en: So how am I to understand all this, O Blessed One?

source: སྒྲུབ་ཐབས་ཀྱི་ཆོ་གས་བསྒྲུབ་པར་བྱ་བ་ནི་དུ་ཞིག་ལགས།
en: Which practice procedure will lead me to success most effectively?

source: གསང་སྔགས་ནི་དུ་ཞིག །ཕྱག་རྒྱ་ནི་དུ་ཞིག །དཀྱིལ་འཁོར་ནི་དུ་ཞིག །
en: What mantra, what mudrā, and what maṇḍala should I use?

source: བྲི་བར་བྱ་བའི་ཕྱག་རྒྱ་ནི་དུ་ཞིག་ལག་པའི་ཕྱག་རྒྱ་ནི་དུ་ཞིག །
en: Which mudrās should I draw, and which should I form with my hands?

source: བདུག་པའི་སྦྱོར་བ་ནི་དུ་ཞིག །
en: Which incense mixture should I use?

source: མིག་སྨན་ནི་དུ་ཞིག །རིལ་བུ་ནི་དུ་ཞིག །
en: Which ointment for the eyes, and which pill?

source: བདུག་པ་ནི་དུ་ཞིག །རས་རིས་ནི་དུ་ཞིག །
en: Which incense should I burn, and which cloth painting should I use?

source: རྩ་བའི་གསང་སྔགས་ནི་དུ་ཞིག །སྙིང་པོ་ནི་དུ་ཞིག །ཉེ་བའི་སྙིང་པོ་ནི་དུ་ཞིག །
en: Which root mantra, which heart mantra, and which auxiliary heart mantra should I recite?

source: ཁྲོ་བོའི་གསང་སྔགས་ནི་དུ་ཞིག །དྲག་པོ་ནི་དུ་ཞིག །ཞི་བ་ནི་དུ་ཞིག །ཡི་གེ་གཅིག་པ་ནི་དུ་ཞིག །ཡི་གེ་གཉིས་པ་ནི་དུ་ཞིག །
en: Which wrathful mantras, which violent mantras, and which peaceful mantras should I employ?

source: ཡི་གེ་གསུམ་པ་ནི་དུ་ཞིག །ཡི་གེ་བཞི་པ་ནི་དུ་ཞིག །ཡི་གེ་ལྔ་པ་ནི་དུ་ཞིག །ཡི་གེ་དྲུག་པ་ནི་དུ་ཞིག །ཡི་གེ་བདུན་པ་ནི་དུ་ཞིག །
en: Which mantras among the one-, two-, three-, four-, five-, six-, seven-, eight-, nine-, or ten-syllable mantras?

source: ཡི་གེ་བརྒྱད་པ་ནི་དུ་ཞིག །
en: How should I observe the ritual fast?

source: ཡི་གེ་དགུ་པ་ནི་དུ་ཞིག །ཡི་གེ་བཅུ་པ་ནི་དུ་ཞིག་ལགས། སྨྱུང་བར་གནས་པ་ཅི་ལྟར་ལགས། ཉིན་མོ་དང་མཚན་མོ་ནི་ཅི་ལྟར།
en: What should my daily and nightly routine be? “

source: ཁྲུས་ཀྱི་ཆོ་ག་ནི་ཅི་ལྟར། གོས་བགོ་བ་ནི་ཅི་ལྟར།
en: How should I perform the ablutions, and how should I dress?

source: ཕྱོགས་བཅིང་བ་ནི་ཅི་ལྟར། དཀྱིལ་འཁོར་བཅིང་བ་ནི་ཅི་ལྟར།
en: How should I bind the directions, and how should I bind the maṇḍala?

source: གཙུག་ཏོར་བཅིང་བ་ནི་ཅི་ལྟར།
en: How should I tie the topknot?

source: བདག་སྲུང་བ་ནི་ཅི་ལྟར། གཞན་སྲུང་བ་ནི་ཅི་ལྟར།
en: How should I perform the protection rite for myself and for others?

source: གྲོགས་སྲུང་བ་ནི་ཅི་ལྟར། སློབ་མ་སྲུང་བ་ནི་ཅི་ལྟར།
en: How should I perform the protection for my assistants and disciples?

source: རབ་ཏུ་འཇུག་པ་ནི་ཅི་ལྟར། ཕྱག་བྱ་བ་ནི་ཅི་ལྟར། བསྐོར་བ་བྱ་བ་ནི་ཅི་ལྟར། མཆོད་ཡོན་དང་།
en: How should I cause the deity to enter, how should I greet it, and how should I circumambulate it?

source: ཞབས་བསིལ་འབུལ་བ་ནི་ཅི་ལྟར། གཏོར་མ་འབུལ་བ་ནི་ཅི་ལྟར། མེ་ཏོག་འབུལ་བ་ནི་ཅི་ལྟར། བདུག་པ་ནི་ཅི་ལྟར། དྲི་ནི་ཅི་ལྟར།
en: How should I offer argha water for the feet, and how should I offer a bali, flowers, incense, fragrances, and lamps?

source: མར་མེ་ནི་ཅི་ལྟར།
en: How should I ritually sip water?

source: ཉེ་རེག་ནི་ཅི་ལྟར།
en: How should I offer food?

source: ལྷ་བཤོས་ནི་ཅི་ལྟར། ཐམས་ཅད་དུ་སྤྱན་དྲང་བ་ནི་ཅི་ལྟར།
en: How can I summon the deity from anywhere?

source: སྙན་གསན་དབབ་པ་ནི་ཅི་ལྟར།
en: How can I invite it?

source: རྨི་ལམ་བསྐུལ་བ་ནི་ཅི་ལྟར།
en: How can I make requests to it in my dreams?

source: སྦྱིན་སྲེག་གི་ཆོ་ག་ནི་ཅི་ལྟར་ལགས།
en: How should I perform the homa ritual?

source: ཞི་བ་ཅན་ནི་དུ་ཞིག་ལགས། རྒྱས་པ་ཅན་ནི་དུ་ཞིག །
en: How should I perform the rites for pacifying, nourishing, and assault? “

source: མངོན་སྤྱོད་ཅན་ནི་དུ་ཞིག །ཞགས་པ་ནི་དུ་ཞིག །རྡོ་རྗེ་ནི་དུ་ཞིག །པདྨ་ནི་དུ་ཞིག །
en: What is the noose, what is the vajra, and what is the lotus?

source: གཤེགས་སུ་གསོལ་བ་ནི་དུ་ཞིག །
en: How can I dismiss the deity?

source: ཉེ་བར་འཕོ་བར་བྱེད་པའི་བྱ་བ་ནི་དུ་ཞིག་ལགས།
en: Which deities should I not approach?

source: བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་ཉིད་ཅི་འདྲ་བ་དང་།
en: I do not know these things, O Blessed One!

source: རྒྱུ་མཚན་ཅི་འདྲ་བ་དང་།
en: What kinds of signs and omens will be conveyed?

source: ཀུན་ཏུ་སྤྱོད་པར་འགྱུར་བ་ནི་མི་ཤེས་སོ།
en: To whom, O Blessed One, shall I pass on the practice procedures?

source: །བཅོམ་ལྡན་འདས་བདག་ལས་སྒྲུབ་པའི་ཆོ་ག་དུ་ཞིག་གི་རྗེས་སུ་འབྲང་བར་བགྱི། བཅོམ་ལྡན་འདས་ཅི་ལྟར་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན། སེམས་ཅན་རྣམས་ཀྱི་རྗེས་སུ་འབྲང་བར་འགྱུར།
en: How, O Blessed One, shall I induce beings during the final time, in the final period, to follow the instructions?

source: དངོས་གྲུབ་དུ་ཞིག་རྗེས་སུ་སྩལ་བར་བགྱི།
en: To whom shall I grant the accomplishment?

source: ཅི་ལྟར་སེམས་ཅན་བླ་ན་མེད་པར་འགྱུར་བར་བགྱི།
en: How will I rescue sentient beings?

source: བཅོམ་ལྡན་འདས་འདི་དག་ལ་བདག་འཁྲུགས་པར་གྱུར་ཅིང་།
en: I am confused, O Blessed One, about this.

source: བདག་ལ་སྤོབས་པ་མེད་དོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཤེས་པར་མི་ནུས་ན།
en: In my intellectual helplessness, I am unable to understand.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོ་གའི་མཚན་ཉིད་ཇི་ལྟ་བ་དེ་དག་བདག་ལ་གསུང་དུ་གསོལ།
en: Please give me, O Blessed One, an accurate description of these things.

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐེ་ཚོམ་མཆིས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་ཐེ་ཚོམ་བཅད་དུ་གསོལ།
en: I have doubts, O Blessed One; please remove my doubts.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་ཞུ་བ་ཡོངས་སུ་ཞུས་པར་གྱུར་པ་གསན་ནས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed Tathāgata Śākyamuni, the worthy one, the fully realized Buddha, listened to the questions that were asked and replied to Vajrapāṇi, the great yakṣa general: “Good!

source: །ལག་ན་རྡོ་རྗེ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བ་འདི་དྲི་བ་ཡོངས་སུ་དྲིས་པ་ནི་ལེགས་སོ།
en: It is good, Vajrapāṇi, that you have asked these questions that are so difficult to answer! You conduct your inquiry to gain intellectual confidence.

source: །ལེགས་སོ།
en: You are compassionate.

source: །ལག་ན་རྡོ་རྗེ་ཁྱོད་ལ་ཡོངས་སུ་འདྲི་བར་བྱེད་པའི་སྤོབས་པ་སྐྱེས་པ་ནི་ལག་ན་རྡོ་རྗེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་དོན་གྱི་ཆེད་ཡོངས་སུ་ཞུས་པའི་ཕྱིར་དང་།
en: You ask questions, Vajrapāṇi, for the benefit of all beings.

source: རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་མཆོག་འགྲུབ་པའི་དོན་དུ་ཡོངས་སུ་ཞུས་པའི་ཕྱིར་དང་། ལག་ན་རྡོ་རྗེ་འདི་ནི་མཆོག་ཏུ་རྨད་དུ་བྱུང་བས་ཏེ།
en: You do this for the sake of all the vidyā holders’ supreme accomplishment.

source: ཕྱི་བཞིན་དུ་རྗེས་སུ་འབྲང་ངོ་། །ལག་ན་རྡོ་རྗེ་འདི་ནི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་མཚུངས་པའོ།
en: Your inquiry, Vajrapāṇi, is wonderful and extraordinary; it is equivalent to the illusion-like samādhi.

source: །ལག་ན་རྡོ་རྗེ་དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོའི་ཆོ་ག །
en: This inquiry, Vajrapāṇi, refers to the heart essence of Amoghapāśa, namely to the procedures found in his great sovereign ritual.

source: རྒྱ་མཚོ་ཆེན་པོ་དུག་ཅན་པ་དང་། ཟབ་བར་མཚུངས་པས་ཏེ། འདི་ནི་གཏིང་དཔག་དཀའ་བའོ།
en: This essence is as deep as the great ocean; it is difficult to fathom.

source: །ལག་ན་རྡོ་རྗེ་རྒྱ་མཚོ་ཆེན་པོ་ཐིགས་པའི་གྲངས་ཀྱིས་བགྲང་བར་ནུས་ཀྱི། ལག་ན་རྡོ་རྗེ་དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་ཚད་ནི་གཟུང་བར་མི་ནུས་སོ།
en: It is impossible, Vajrapāṇi, to count the water drops in the great ocean, and similarly, Vajrapāṇi, it is impossible to grasp the measure and scale of the inner essence of Amoghapāśa. “
